Tekla Open API Reference for Tekla Structures 2025
ProfileItemSubType Class
 The ProfileItemSubType class contains the information of one profile item sub type (id, label, parameter string and bitmap name). A profile item can contain a maximum of 10 profile item sub types.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Catalogs.ProfileItemSubType
 Namespace: Tekla.Structures.Catalogs
 Assembly: Tekla.Structures.Catalogs (in Tekla.Structures.Catalogs.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public sealed class ProfileItemSubType
<SerializableAttribute>
Public NotInheritable Class ProfileItemSubType
The ProfileItemSubType type exposes the following members.
Constructors
Name | Description
ProfileItemSubType
Initializes a new instance of the ProfileItemSubType class
Top
Properties
Name | Description
BitmapName
 Gets a value of the property BitmapName.
Label
 Gets a value of the property Label.
ParameterString
 Gets a value of the property ParameterString.
SubTypeId
 Gets a value of the property SubTypeId.
Top
See Also
Reference
Tekla.Structures.Catalogs Namespace